Masmiseim36/nxpSDK/boards/twrkv46f150m/bootloader_examples/tower_bootloader/pin_mux.c
/*
 * Copyright 2020 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v7.0
processor: MKV46F256xxx16
package_id: MKV46F256VLL16
mcu_data: ksdk2_0
processor_version: 7.0.1
board: TWR-KV46F150M
pin_labels:
- {pin_num: '42', pin_signal: CMP2_IN0/PTA12/CAN0_TX/FTM1_CH0/FTM1_QD_PHA, label: 'U503[1]/J16[1]/J500[B42]/J502[15]/GPIOA12/CAN0_TX', identifier: TX}
- {pin_num: '43', pin_signal: CMP2_IN1/PTA13/LLWU_P4/CAN0_RX/FTM1_CH1/FTM1_QD_PHB, label: 'U503[4]/J16[3]/J500[B41]/J502[17]/GPIOA12/CAN0_RX', identifier: RX}
- {pin_num: '53', pin_signal: ADCB_CH2/PTB0/LLWU_P5/I2C0_SCL/FTM1_CH0/FTM1_QD_PHA/UART0_RX, label: 'J500[B28]/J501[22]/GPIOB0/ADCB_CH2', identifier: SCL}
- {pin_num: '54', pin_signal: ADCB_CH3/PTB1/I2C0_SDA/FTM1_CH1/FTM0_FLT2/EWM_IN/FTM1_QD_PHB/UART0_TX, label: 'J500[B27]/J501[33]/GPIOB1/ADCB_CH3', identifier: SDA}
- {pin_num: '99', pin_signal: ADCA_CH7g/PTD6/LLWU_P15/SPI0_PCS3/UART0_RX/FTM0_CH6/FTM1_CH0/FTM0_FLT0/SPI0_SOUT, label: 'J500[A41]/J506[2]/GPIOD6/RXD0', identifier: RX_GPIO;RX}
- {pin_num: '100', pin_signal: PTD7/UART0_TX/FTM0_CH7/FTM1_CH1/FTM0_FLT1/SPI0_SIN, label: 'J500[A42]/J505[2]/GPIOD7/TXD0', identifier: TX}
- {pin_num: '10', pin_signal: ADCA_CH0/PTE16/SPI0_PCS0/UART1_TX/FTM_CLKIN0/FTM0_FLT3, label: 'J500[A27]/J501[10]/GPIOE16/ADCA_CH0', identifier: PCS}
- {pin_num: '11', pin_signal: ADCA_CH1/PTE17/LLWU_P19/SPI0_SCK/UART1_RX/FTM_CLKIN1/LPTMR0_ALT3, label: 'J500[A28]/J501[12]/GPIOE17/ADCA_CH1', identifier: SCK}
- {pin_num: '12', pin_signal: ADCB_CH0/PTE18/LLWU_P20/SPI0_SOUT/UART1_CTS_b/I2C0_SDA, label: 'J500[B30]/J501[18]/ADCB_CH0', identifier: SOUT}
- {pin_num: '13', pin_signal: ADCB_CH1/PTE19/SPI0_SIN/UART1_RTS_b/I2C0_SCL/CMP3_OUT, label: 'J500[B29]/J501[20]/ADCB_CH1', identifier: SIN}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "fsl_common.h"
#include "fsl_port.h"
#include "fsl_gpio.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void)
{
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitBootPin:
- options: {callFromInitBoot: 'false', prefix: BOOT_PIN_, coreID: core0, enableClock: 'false'}
- pin_list:
  - {pin_num: '79', peripheral: GPIOC, signal: 'GPIO, 7', pin_signal: CMP3_IN4/CMP0_IN1/PTC7/SPI0_SIN/XBARIN4/UART0_TX/XBAROUT7/I2C0_SDA, direction: INPUT, slew_rate: slow,
    pull_select: up, pull_enable: enable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPin
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPin(void)
{

    gpio_pin_config_t SW1_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTC7 (pin 79)  */
    GPIO_PinInit(BOOT_PIN_SW1_GPIO, BOOT_PIN_SW1_PIN, &SW1_config);

    const port_pin_config_t SW1 = {/* Internal pull-up resistor is enabled */
                                   kPORT_PullUp,
                                   /* Slow slew rate is configured */
                                   kPORT_SlowSlewRate,
                                   /* Passive filter is disabled */
                                   kPORT_PassiveFilterDisable,
                                   /* Open drain is enabled */
                                   kPORT_OpenDrainEnable,
                                   /* Low drive strength is configured */
                                   kPORT_LowDriveStrength,
                                   /* Pin is configured as PTC7 */
                                   kPORT_MuxAsGpio,
                                   /* Pin Control Register fields [15:0] are not locked */
                                   kPORT_UnlockRegister};
    /* PORTC7 (pin 79) is configured as PTC7 */
    PORT_SetPinConfig(BOOT_PIN_SW1_PORT, BOOT_PIN_SW1_PIN, &SW1);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
UART0_PollForActivity:
- options: {callFromInitBoot: 'false', coreID: core0, enableClock: 'false'}
- pin_list:
  - {pin_num: '99', peripheral: GPIOD, signal: 'GPIO, 6', pin_signal: ADCA_CH7g/PTD6/LLWU_P15/SPI0_PCS3/UART0_RX/FTM0_CH6/FTM1_CH0/FTM0_FLT0/SPI0_SOUT, identifier: RX_GPIO,
    direction: INPUT}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : UART0_PollForActivity
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void UART0_PollForActivity(void)
{

    gpio_pin_config_t RX_GPIO_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTD6 (pin 99)  */
    GPIO_PinInit(UART0_POLLFORACTIVITY_RX_GPIO_GPIO, UART0_POLLFORACTIVITY_RX_GPIO_PIN, &RX_GPIO_config);

    /* PORTD6 (pin 99) is configured as PTD6 */
    PORT_SetPinMux(UART0_POLLFORACTIVITY_RX_GPIO_PORT, UART0_POLLFORACTIVITY_RX_GPIO_PIN, kPORT_MuxAsGpio);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
UART0_InitPins:
- options: {callFromInitBoot: 'false', prefix: UART0_, coreID: core0, enableClock: 'false'}
- pin_list:
  - {pin_num: '99', peripheral: UART0, signal: RX, pin_signal: ADCA_CH7g/PTD6/LLWU_P15/SPI0_PCS3/UART0_RX/FTM0_CH6/FTM1_CH0/FTM0_FLT0/SPI0_SOUT, identifier: RX}
  - {pin_num: '100', peripheral: UART0, signal: TX, pin_signal: PTD7/UART0_TX/FTM0_CH7/FTM1_CH1/FTM0_FLT1/SPI0_SIN}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

