Masmiseim36/nxpSDK/boards/twrkv46f150m/bootloader_examples/tower_bootloader/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : SPI0_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void SPI0_InitPins(void)
{

    /* PORTE16 (pin 10) is configured as SPI0_PCS0 */
    PORT_SetPinMux(SPI0_PCS_PORT, SPI0_PCS_PIN, kPORT_MuxAlt2);

    /* PORTE17 (pin 11) is configured as SPI0_SCK */
    PORT_SetPinMux(SPI0_SCK_PORT, SPI0_SCK_PIN, kPORT_MuxAlt2);

    /* PORTE18 (pin 12) is configured as SPI0_SOUT */
    PORT_SetPinMux(SPI0_SOUT_PORT, SPI0_SOUT_PIN, kPORT_MuxAlt2);

    /* PORTE19 (pin 13) is configured as SPI0_SIN */
    PORT_SetPinMux(SPI0_SIN_PORT, SPI0_SIN_PIN, kPORT_MuxAlt2);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
SPI0_RestoreDefault:
- options: {callFromInitBoot: 'false', coreID: core0, enableClock: 'false'}
- pin_list:
  - {pin_num: '10', peripheral: ADC, signal: 'ADCA, 0', pin_signal: ADCA_CH0/PTE16/SPI0_PCS0/UART1_TX/FTM_CLKIN0/FTM0_FLT3}
  - {pin_num: '11', peripheral: ADC, signal: 'ADCA, 1', pin_signal: ADCA_CH1/PTE17/LLWU_P19/SPI0_SCK/UART1_RX/FTM_CLKIN1/LPTMR0_ALT3}
  - {pin_num: '12', peripheral: ADC, signal: 'ADCB, 0', pin_signal: ADCB_CH0/PTE18/LLWU_P20/SPI0_SOUT/UART1_CTS_b/I2C0_SDA}
  - {pin_num: '13', peripheral: ADC, signal: 'ADCB, 1', pin_signal: ADCB_CH1/PTE19/SPI0_SIN/UART1_RTS_b/I2C0_SCL/CMP3_OUT}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : SPI0_RestoreDefault
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void SPI0_RestoreDefault(void)
{

    /* PORTE16 (pin 10) is configured as ADCA_CH0 */
    PORT_SetPinMux(SPI0_RESTOREDEFAULT_PCS_PORT, SPI0_RESTOREDEFAULT_PCS_PIN, kPORT_PinDisabledOrAnalog);

    /* PORTE17 (pin 11) is configured as ADCA_CH1 */
    PORT_SetPinMux(SPI0_RESTOREDEFAULT_SCK_PORT, SPI0_RESTOREDEFAULT_SCK_PIN, kPORT_PinDisabledOrAnalog);

    /* PORTE18 (pin 12) is configured as ADCB_CH0 */
    PORT_SetPinMux(SPI0_RESTOREDEFAULT_SOUT_PORT, SPI0_RESTOREDEFAULT_SOUT_PIN, kPORT_PinDisabledOrAnalog);

    /* PORTE19 (pin 13) is configured as ADCB_CH1 */
    PORT_SetPinMux(SPI0_RESTOREDEFAULT_SIN_PORT, SPI0_RESTOREDEFAULT_SIN_PIN, kPORT_PinDisabledOrAnalog);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
CAN0_InitPins:
- options: {callFromInitBoot: 'false', prefix: CAN0_, coreID: core0, enableClock: 'false'}
- pin_list:
  - {pin_num: '43', peripheral: CAN0, signal: RX, pin_signal: CMP2_IN1/PTA13/LLWU_P4/CAN0_RX/FTM1_CH1/FTM1_QD_PHB}
  - {pin_num: '42', peripheral: CAN0, signal: TX, pin_signal: CMP2_IN0/PTA12/CAN0_TX/FTM1_CH0/FTM1_QD_PHA}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : CAN0_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void CAN0_InitPins(void)
{

    /* PORTA12 (pin 42) is configured as CAN0_TX */
    PORT_SetPinMux(CAN0_TX_PORT, CAN0_TX_PIN, kPORT_MuxAlt2);

    /* PORTA13 (pin 43) is configured as CAN0_RX */
    PORT_SetPinMux(CAN0_RX_PORT, CAN0_RX_PIN, kPORT_MuxAlt2);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
CAN0_RestoreDefault:
- options: {callFromInitBoot: 'false', coreID: core0, enableClock: 'false'}
- pin_list:
  - {pin_num: '43', peripheral: CMP2, signal: 'IN, 1', pin_signal: CMP2_IN1/PTA13/LLWU_P4/CAN0_RX/FTM1_CH1/FTM1_QD_PHB}
  - {pin_num: '42', peripheral: CMP2, signal: 'IN, 0', pin_signal: CMP2_IN0/PTA12/CAN0_TX/FTM1_CH0/FTM1_QD_PHA}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : CAN0_RestoreDefault
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void CAN0_RestoreDefault(void)
{

    /* PORTA12 (pin 42) is configured as CMP2_IN0 */
    PORT_SetPinMux(CAN0_RESTOREDEFAULT_TX_PORT, CAN0_RESTOREDEFAULT_TX_PIN, kPORT_PinDisabledOrAnalog);

    /* PORTA13 (pin 43) is configured as CMP2_IN1 */
    PORT_SetPinMux(CAN0_RESTOREDEFAULT_RX_PORT, CAN0_RESTOREDEFAULT_RX_PIN, kPORT_PinDisabledOrAnalog);
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
